; $Header: /cag/LEGO/batch/partsmac/800/batch.ini 1.30 2002-04-08 07:23:42-07 fkremser Exp $
;
; DESCRIPTION:
;        Top toolbar for batch review

[GraphicalObject]
Name=batch
PosStyle=BOTTOMMOST
X=0
Y=0
Width=236
Height=40
FrameThickness=1
Activate=0
RC-DLL=LANGUAGE\HLBAT008.CHS

[ToolDescriptor]
1 = BatActual,    STATIC,          hpgwct02.DLL
2 = BatFile,      PUSHBUTTON,      hpgbut02.dll
3 = BatLoad,      PUSHBUTTON,      hpgbut02.dll
4 = BatSave,      PUSHBUTTON,      hpgbut02.dll
5 = BatGroup,     GROUPFRAME,      hpgbut02.dll

6 = Sort,         STATIC,          hpgwct02.DLL
7 = By,           STATIC,          hpgwct02.DLL
8 = SortCriteria, NONEDITCOMBOBOX, hpgwct02.dll
9 = SortGroup,    GROUPFRAME,      hpgbut02.dll

10= AutoStart,    ImageSet,        hpgbut02.dll
11= AutoStop,     PushButton,      hpgbut02.dll
12= AutoPrev,     PushButton,      hpgbut02.dll
13= AutoNext,     PushButton,      hpgbut02.dll
14= RunSave,      PushButton,      hpgbut02.dll
15= RunPurge,     PushButton,      hpgbut02.dll
16= AutoGroup,    GROUPFRAME,      hpgbut02.dll

17= Layout,       StickyButton,    hpgbut02.dll
;18= ReIntegrate,  PushButton,      hpgbut02.dll
18= ReCalibrate,  PushButton,      hpgbut02.dll
19= Option,       PushButton,      hpgbut02.dll

20= PreviewBatch, PUSHBUTTON,      hpgbut02.dll
21= PrintBatch,   PUSHBUTTON,      hpgbut02.dll
22= HelpBatch,    PUSHBUTTON,      hpgbut02.dll
23= ExitBatch,    PUSHBUTTON,      hpgbut02.dll

24= AddButtons,   GROUPFRAME,      hpgbut02.dll

25= GroupBottom,  GROUPFRAME,      hpgbut02.dll


[fontalias]
1=normal|宋体,9,normal
2=bold|宋体,9,bold

[STATIC BatActual]
x=5
y=5
width=70
height=18
Text1=
BKColor=255,255,255
Enable=1
Dimage=4
Justify=Center
Command=@View.ComboMenu "_Config[1]","BatchFile"
Help=当前批处理
Font=normal
FrameThickness=1

[PushButton BatFile]
x=75
y=5
width=20
height=18
Command=@View.ComboMenu "_Config[1]","BatchFile"
ImageList=RBMP.PullDown|RBMP.PullDown|RBMP.PullDown_Disable
Help=从最近调用的批处理文件中选择。
FrameThickness=1

[PushButton BatLoad]
x=100
y=5
width=38
height=30
Command=BatchLoad
ImageList=RBMP.Batch_Load|RBMP.Batch_Load|RBMP.Batch_LoadDisabled
Help=调用批处理文件
FrameThickness=2

[PushButton BatSave]
x=138
y=5
width=38
height=30
Command=BatchSave
ImageList=RBMP.Batch_Save|RBMP.Batch_Save|RBMP.Batch_SaveDisabled
Help=保存一个批处理文件
FrameThickness=2

[GroupFrame BatGroup]
x=180
y=1
width=2
height=38
FrameThickness=1

[STATIC Sort]
x=186
y=1
width=90
height=13
Text1=排列方式
Justify=Left
Font=normal

[NONEDITCOMBOBOX SortCriteria]
x=186
y=14
width=90
height=90
MaxListsize=4
Sorted=0
DefCommand="BatchSort "
TextList="运行索引|样品类型|方法|数据文件"
DEFCmdParnumber=1
BKColor=255,255,255
Justify=Center
Help=选择批处理浏览表格的排序条件。
Font=normal
FrameThickness=0

[GroupFrame SortGroup]
x=280
y=1
width=2
height=38
FrameThickness=1

[ImageSet AutoStart]
;x=286
x=322
y=3
width=46
height=17
FrameThickness=1
SetIndex=0
Set0=RBMP.Run_StartDisabled|RBMP.Run_StartDisabledPressed|RBMP.Run_StartDisabled|print "没有调用批处理！！！"|单击该图标, 开始当前批处理自动浏览。
Set1=RBMP.Run_Start|RBMP.Run_StartPressed|RBMP.Run_StartDisabled|CPBatch.BatchControlEngine 3|单击该图标, 开始当前批处理自动浏览。
Set2=RBMP.Run_StartDisabled|RBMP.Run_StartDisabledPressed|RBMP.Run_StartDisabled||单击该图标, 开始当前批处理自动浏览。
Set3=RBMP.Run_Start|RBMP.Run_StartPressed|RBMP.Run_StartDisabled|CPBatch.BatchControlEngine 3|单击该图标, 开始当前批处理自动浏览。
Set4=RBMP.Run_Pause|RBMP.Run_PausePressed|RBMP.Run_PauseDisabled|CPBatch.BatchControlEngine 1|单击该图标, 暂停当前批处理自动浏览。
Set5=RBMP.Run_Resume|RBMP.Run_ResumePressed|RBMP.Run_ResumeDisabled|CPBatch.BatchControlEngine 0|单击该图标, 恢复当前批处理自动浏览。
Set6=RBMP.Run_StartDisabled|RBMP.Run_StartDisabledPressed|RBMP.Run_StartDisabled||单击该图标, 开始当前批处理自动浏览。

[PushButton AutoStop]
;x=286
x=322
y=20
width=46
height=17
Help=单击该图标,  停止当前批处理自动浏览。
ImageList=RBMP.Run_Stop|RBMP.Run_Stop|RBMP.Run_StopDisabled
Command=CPBatch.BatchControlEngine 2

[PushButton AutoPrev]
;x=337
x=373
y=3
width=17
height=17
Help=点击该图标,  从前一运行中调用数据。
ImageList=RBMP.Run_Prev|RBMP.Run_Prev|RBMP.Run_PrevDisabled
Command=BatchExecuteRun _BatchRunIndex-1
FrameThickness=1

[PushButton AutoNext]
;x=337
x=373
y=20
width=17
height=17
Help=点击该图标,  从后面的运行中调用数据。
ImageList=RBMP.Run_Next|RBMP.Run_Next|RBMP.Run_NextDisabled
Command=BatchExecuteRun _BatchRunIndex+1
FrameThickness=1

[PushButton RunSave]
;x=359
x=395
y=3
width=38
height=17
Help=点击该图标, 标记到目前为止已完成的当前运行中的改变，以便与批处理文件一起保存。
ImageList=RBMP.Chrom_Keep|RBMP.Chrom_Keep|RBMP.Chrom_KeepDisabled
Command=BatchSaveRun _BatchRunIndex
FrameThickness=1

[PushButton RunPurge]
;x=359
x=395
y=20
width=38
height=17
Help=点击该图标, 放弃对运行所做的改动。
ImageList=RBMP.Chrom_Purge|RBMP.Chrom_Purge|RBMP.Chrom_PurgeDisabled
Command=BatchPurgeRun _BatchRunIndex
FrameThickness=1

;[PushButton ReIntegrate]
;x=401
;y=5
;width=30
;height=30
;Help=Click to reintegrate all chromatograms on reload.
;ImageList=RBMP.Reintegrate|RBMP.Reintegrate|RBMP.Reintegrate_Disabled
;Command=BatchReintegrate

[PushButton ReCalibrate]
;x=403
x=286
y=5
width=30
height=30
Help=点击该图标, 根据所有已校正的批处理运行来更新校正表。
ImageList=RBMP.Recalibrate|RBMP.Recalibrate|RBMP.Recalibrate_Disabled
Command=BatchRecalibrate

[GroupFrame AutoGroup]
x=436
y=1
width=0
height=36
FrameThickness=0

; keep room for combobox or other options in table view.
; see in batcombo.ini or in batttool.ini for number of pixel!

[StickyButton Layout]
x=731
y=5
width=30
height=30
Help=显示/隐藏批处理表
ImageList=RBMP.LayComb|RBMP.LayComb0|RBMP.LayComb|RBMP.LayComb0
CmdList=CpBatch.BatchShowToolBar 1| CpBatch.BatchShowToolBar 0
FrameThickness=2

[PushButton Option]
x=766	；必须为 766，以在宽为 800 的屏幕的最左端显示此按钮
y=5
width=30
height=30
Help=点击以定义批处理及版面选项。
ImageList=RBMP.Batch_Option|RBMP.Batch_Option|RBMP.Batch_OptionDisabled
Command=BatchDoOptionDialog

[PushButton PreviewBatch]
x=801
y=5
width=30
height=30
Command=BatchDoOutput "SCREEN"
ImageList=RBMP.Batch_Preview|RBMP.Batch_Preview|RBMP.Batch_PreviewDisabled
Help=点击以预览批处理报告
FrameThickness=2

[PushButton PrintBatch]
x=831
y=5
width=30
height=30
Command=BatchDoOutput "PRINTER"
ImageList=RBMP.Batch_Print|RBMP.Batch_Print|RBMP.Batch_PrintDisabled
Help=点击以打印批处理报告
FrameThickness=2

[PushButton HelpBatch]
x=861
y=5
width=30
height=30
Command=CPBatch.Help 10000
ImageList=RBMP.Batch_Help|RBMP.Batch_Help|RBMP.Batch_HelpDisabled
Help=单击以获得帮助.
FrameThickness=2

[PushButton ExitBatch]
x=891
y=5
width=30
height=30
Command=BatchExit
ImageList=RBMP.Batch_Exit|RBMP.Batch_Exit|RBMP.Batch_ExitDisabled
Help=点击以关闭批处理浏览。
FrameThickness=2

[GroupFrame AddButtons]
x=925
y=1
width=2
height=38
FrameThickness=1

[GroupFrame GroupBottom]
x=0
y=39
width=2000
height=2
FrameThickness=1

